# RoundRevisionCloudSpacing Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevisionSettings..::..RoundRevisionCloudSpacing Method
RevisionSettings Class See Also
---
Rounds the given revision cloud spacing value according to the document's settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static double RoundRevisionCloudSpacing(
	Document ccda,
	double rawValue
)
```

Visual Basic
---
```text
Public Shared Function RoundRevisionCloudSpacing ( _
	ccda As Document, _
	rawValue As Double _
) As Double
```

Visual C++
---
```text
public:
static double RoundRevisionCloudSpacing(
	Document^ ccda,
	double rawValue
)
```

# ### Parameters
ccda
    Type: Autodesk.Revit.DB..::..Document The document to use for rounding.
rawValue
    Type: System..::..Double The unrounded value.
# ### Return Value
The rounded revision cloud spacing.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RevisionSettings Class
Autodesk.Revit.DB Namespace